0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-06;

boundaryField
{
    inlet
    {
        // Open boundary: outflow uses zeroGradient, inflow uses inletValue
        type            inletOutlet;
        inletValue      uniform 1e-06;
        value           uniform 1e-06;
    }

    outlet
    {
        // Open boundary for possible local recirculation
        type            inletOutlet;
        inletValue      uniform 1e-06;
        value           uniform 1e-06;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 1e-06;
    }

    ceiling
    {
        type            epsilonWallFunction;
        value           uniform 1e-06;
    }
}

// ************************************************************************* //
