0/p
/*--------------------------------*- C++ -*----------------------------------*\\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        // Door opening to ambient: set static pressure reference
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        // Exhaust uses specified flow rate on U; pressure is zeroGradient
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }

    ceiling
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
