system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  Field         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   Operation     | Website:  https://openfoam.org
|   \\  /    And           | Version:  12
|    \\/     Manipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Select the room volume as a cellSet
    {
        name    roomZoneSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0 0 0) (5 3 2.3);
        }
    }

    // Convert the cellSet to a cellZone
    {
        name    roomZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set roomZoneSet;
        }
    }

    // Select ceiling center faces for outlet (0.4m x 0.4m)
    {
        name    outletFaceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            // Room center at (2.5, 1.5, 2.3), select +/-0.2m in x,y near z=2.3
            box (2.3 1.3 2.29) (2.7 1.7 2.31);
        }
    }

    // Select inlet on x=0 starting at origin: y:[0,1], z:[0,2]
    {
        name    inletFaceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            // Thin slab around x=0 to capture that wall only
            box (-0.01 0.0 0.0) (0.01 1.0 2.0);
        }
    }
);

// ************************************************************************* //
